<h3><center>Data Munging</center></h3>

In [1]:
# Importing...
import numpy as np
import pandas as pd

In [2]:
# Creating dictionary
dic = {'X':[1, 2, 3, 4], 'Y': [4, 5, 6, 7], 'Z': [8, 9, 10, 11]}

In [3]:
# Creating a simple DataFrame
df = pd.DataFrame.from_dict(dic)

In [46]:
# Creating a simple DataFrame with Multindex
df2 = pd.DataFrame(np.random.randint(1, 10), 
                   columns=['column {}'.format(x) for x in range(2)], 
                   index=pd.MultiIndex.from_product([['97', '98', '99'], [10, 40]]))
# If you are the function from_arrays your arrays should be of the same length

In [44]:
df2

       column 0  column 1
97 10         5         5
   40         5         5
98 10         5         5
   40         5         5
99 10         5         5
   40         5         5

In [6]:
# Printing...
df

   X  Y   Z
0  1  4   8
1  2  5   9
2  3  6  10
3  4  7  11

In [7]:
# Overview about my DataFrame
df.describe()

              X         Y          Z
count  4.000000  4.000000   4.000000
mean   2.500000  5.500000   9.500000
std    1.290994  1.290994   1.290994
min    1.000000  4.000000   8.000000
25%    1.750000  4.750000   8.750000
50%    2.500000  5.500000   9.500000
75%    3.250000  6.250000  10.250000
max    4.000000  7.000000  11.000000

In [8]:
# Printing the index
df.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
# Priting the columns
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [10]:
# Type
type(df)

pandas.core.frame.DataFrame

In [11]:
# Index and values
df['X']

0    1
1    2
2    3
3    4
Name: X, dtype: int64

In [12]:
# Values of Y
df['Y'].values

array([4, 5, 6, 7])

In [13]:
# Values of Z
df.Z.values

array([ 8,  9, 10, 11])

In [14]:
# Recovery only the information relevant for me
df[['X', 'Y']]

   X  Y
0  1  4
1  2  5
2  3  6
3  4  7

In [15]:
# Get index values
df.iloc[0]

X    1
Y    4
Z    8
Name: 0, dtype: int64

In [16]:
# Get a specific element
df.get('Z')

0     8
1     9
2    10
3    11
Name: Z, dtype: int64

In [17]:
# Sclicing...
df[2:]

   X  Y   Z
2  3  6  10
3  4  7  11

In [18]:
# Sclicing...
df[1:3]

   X  Y   Z
1  2  5   9
2  3  6  10

In [19]:
# Sclicing... by indexing
df.loc[1]

X    2
Y    5
Z    9
Name: 1, dtype: int64

In [20]:
# Sclicing... by indexing
df.loc[3]

X     4
Y     7
Z    11
Name: 3, dtype: int64

In [21]:
# Sclicing... by indexing
df.loc[1][1]

5

In [22]:
# Sclicing... by indexing
df.loc[1] > 5

X    False
Y    False
Z     True
Name: 1, dtype: bool

In [23]:
# Sclicing... by indexing
df.iloc[1, :2]

X    2
Y    5
Name: 1, dtype: int64

In [24]:
# Sclicing... by indexing
df.iloc[2:, -1]

2    10
3    11
Name: Z, dtype: int64

In [25]:
# Sclicing...
df[1:4:2]

   X  Y   Z
1  2  5   9
3  4  7  11

In [26]:
# Slicing...
df[:1]

   X  Y  Z
0  1  4  8

In [27]:
# Slicing...
df[::2]

   X  Y   Z
0  1  4   8
2  3  6  10

In [28]:
# Sclicing... by indexing
df.loc[:, df.loc[1] > 7]

    Z
0   8
1   9
2  10
3  11

In [29]:
# Sclicing... by indexing
df.iloc[1:2, :2]

   X  Y
1  2  5

In [30]:
# Slicing...
df[:-1]

   X  Y   Z
0  1  4   8
1  2  5   9
2  3  6  10

In [31]:
# Slicing...
df[-1:]

   X  Y   Z
3  4  7  11

In [32]:
# Deleting column
del df['Z']

In [33]:
# Inserting another column with values
df.insert(2, 'J', (1, 2, 3, 4))

In [34]:
# Printing...
df

   X  Y  J
0  1  4  1
1  2  5  2
2  3  6  3
3  4  7  4